<?php
return [
    'title' => 'نحن نستخدم ملفات تعريف الارتباط',
    'intro' => 'يستخدم هذا الموقع ملفات تعريف الارتباط من أجل تحسين تجربة المستخدم الإجمالية.',
    'link' => 'ألق نظرة على <a href=":url"> سياسة ملفات تعريف الارتباط </a> لمزيد من المعلومات.',
    'essentials' => 'الضروريات فقط',
    'all' => 'قبول الكل',
    'customize' => 'تخصيص',
    'manage' => 'إدارة ملفات تعريف الارتباط',
    'details' => [
        'more' => 'المزيد من التفاصيل',
        'less' => 'تفاصيل أقل',
    ],
    'save' => 'احفظ التغييرات',

    'categories' => [
        'essentials' => [
            'title' => 'ملفات تعريف الارتباط الأساسية',
            'description' => 'هناك بعض ملفات تعريف الارتباط التي يتعين علينا تضمينها حتى تعمل صفحات ويب معينة. لهذا السبب ، فهي لا تتطلب موافقتك.',
        ],
        'analytics' => [
            'title' => 'ملفات تعريف الارتباط التحليلية',
            'description' => 'نستخدمها في البحث الداخلي حول كيفية تحسين الخدمة التي نقدمها لجميع مستخدمينا. تقيم ملفات تعريف الارتباط هذه كيفية تفاعلك مع موقعنا.',
        ],
        'optional' => [
            'title' => 'ملفات تعريف الارتباط الاختيارية',
            'description' => 'تعمل ملفات تعريف الارتباط هذه على تمكين الميزات التي يمكن أن تحسن تجربة المستخدم الخاصة بك ، ولكن غيابها لن يؤثر على قدرتك على تصفح موقعنا.',
        ],
    ],

    'defaults' => [
        'consent' => 'تُستخدم لتخزين تفضيلات الموافقة على ملفات تعريف الارتباط الخاصة بالمستخدم.',
        'session' => 'يستخدم لتحديد جلسة تصفح المستخدم.',
        'csrf' => 'تُستخدم لتأمين كل من المستخدم وموقع الويب الخاص بنا ضد هجمات التزوير عبر المواقع.',
        '_ga' => 'ملف تعريف الارتباط الرئيسي الذي يستخدمه Google Analytics ، يمكّن الخدمة من تمييز زائر عن آخر.',
        '_ga_ID' => 'تستخدم من قبل Google Analytics لاستمرار حالة الجلسة.',
        '_gid' => 'يستخدمه برنامج Google Analytics لتحديد هوية المستخدم.',
        '_gat' => 'تستخدم بواسطة Google Analytics لخفض معدل الطلب.',
    ],
];